Repository: Sandeep123451/vakilseva
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: hi, te

source: Case Law Finder
hi: केस लॉ खोजें
te: కేసు చట్టాన్ని కనుగొనుము

source: VakilSeva
hi: वकीलसेवा
te: వకీల్‌సేవ

source: Home
hi: होम
te: హోమ్

source: Features
hi: विशेषताएँ
te: ఫీచర్లు

source: AI Legal Chatbot
hi: एआई कानूनी चैटबॉट
te: AI లీగల్ చాట్‌బాట్

source: Document Drafting
hi: दस्तावेज़ मसौदा
te: పత్రం డ్రాఫ్టింగ్

source: Legal Dictionary
hi: कानूनी शब्दकोश
te: చట్టపరమైన నిఘంటువు

source: Legal Aid Checker
hi: कानूनी सहायता जांच
te: చట్టపరమైన సహాయ తనిఖీ

source: Document Scanner
hi: दस्तावेज़ स्कैनर
te: పత్రం స్కానర్

source: About
hi: हमारे बारे में
te: గురించి

source: Contact
hi: संपर्क
te: సంప్రదించండి

source: Logout
hi: लॉग आउट
te: లాగ్ అవుట్

source: Supreme Court Case Finder
hi: सुप्रीम कोर्ट केस खोजें
te: సుప్రీం కోర్ట్ కేసు ఫైండర్

source: Use our AI-powered search to find relevant case law and summaries.
hi: प्रासंगिक केस कानून और सारांश खोजने के लिए हमारी एआई-संचालित खोज का उपयोग करें।
te: సంబంధిత కేసు చట్టం మరియు సారాంశాలను కనుగొనడానికి మా AI-ఆధారిత శోధనను ఉపయోగించండి.

source: Enter Topic, Act, Petitioner Name...
hi: विषय, अधिनियम, याचिकाकर्ता का नाम दर्ज करें...
te: విషయం, చట్టం, పిటిషనర్ పేరు నమోదు చేయండి...

source: All Recent Years
hi: सभी हाल के वर्ष
te: అన్ని ఇటీవలి సంవత్సరాలు

source: Search Cases
hi: केस खोजें
te: కేసులను శోధించండి

source: Searching and analyzing relevant cases...
hi: प्रासंगिक मामलों की खोज और विश्लेषण किया जा रहा है...
te: సంబంధిత కేసులను శోధిస్తోంది మరియు విశ్లేషిస్తోంది...

source: © 2025 VakilSeva. All Rights Reserved.
hi: © 2025 वकीलसेवा। सर्वाधिकार सुरक्षित।
te: © 2025 వకీల్‌సేవ. అన్ని హక్కులు ప్రత్యేకించబడినవి.

source: Error:
hi: त्रुटि:
te: లోపం:

source: The AI could not find specific cases for your query. Please try a different search term.
hi: एआई आपकी क्वेरी के लिए विशिष्ट मामले नहीं ढूंढ सका। कृपया एक अलग खोज शब्द का प्रयास करें।
te: మీ ప్రశ్న కోసం AI నిర్దిష్ట కేసులను కనుగొనలేకపోయింది. దయచేసి వేరే శోధన పదాన్ని ప్రయత్నించండి.

source: A critical error occurred: Could not connect to the server.
hi: एक गंभीर त्रुटि हुई: सर्वर से कनेक्ट नहीं हो सका।
te: ఒక క్లిష్టమైన లోపం సంభవించింది: సర్వర్‌కు కనెక్ట్ చేయలేకపోయింది.

source: No Title Found
hi: कोई शीर्षक नहीं मिला
te: శీర్షిక కనుగొనబడలేదు

source: No Summary Found
hi: कोई सारांश नहीं मिला
te: సారాంశం కనుగొనబడలేదు

source: Please enter a search topic.
hi: कृपया एक खोज विषय दर्ज करें।
te: దయచేసి ఒక శోధన అంశాన్ని నమోదు చేయండి.

source: Hello! I'm your AI legal assistant. How can I help you understand a legal topic today?
hi: नमस्ते! मैं आपका एआई कानूनी सहायक हूं। मैं आज आपको कानूनी विषय समझने में कैसे मदद कर सकता हूं?
te: నమస్కారం! నేను మీ AI చట్టపరమైన సహాయకుడిని. ఈ రోజు నేను మీకు ఒక చట్టపరమైన అంశాన్ని అర్థం చేసుకోవడంలో ఎలా సహాయపడగలను?

source: Ask a legal question...
hi: एक कानूनी सवाल पूछें...
te: ఒక చట్టపరమైన ప్రశ్న అడగండి...

source: VakilSeva is typing...
hi: वकीलसेवा टाइप कर रहा है...
te: వకీల్‌సేవ టైప్ చేస్తోంది...

source: Sorry, an error occurred. Please try again.
hi: क्षमा करें, एक त्रुटि हुई। कृपया पुन: प्रयास करें।
te: క్షమించండి, ఒక లోపం సంభవించింది. దయచేసి మళ్ళీ ప్రయత్నించండి.

source: Professional Legal Document Drafting
hi: पेशेवर कानूनी दस्तावेज़ मसौदा
te: వృత్తిపరమైన చట్టపరమైన పత్రం డ్రాఫ్టింగ్

source: Follow the steps to generate your customized legal document.
hi: अपना अनुकूलित कानूनी दस्तावेज़ बनाने के लिए चरणों का पालन करें।
te: మీ అనుకూలీకరించిన చట్టపరమైన పత్రాన్ని రూపొందించడానికి దశలను అనుసరించండి.

source: Step 1: Choose the type of document you need
hi: चरण 1: आपको जिस प्रकार के दस्तावेज़ की आवश्यकता है उसे चुनें
te: దశ 1: మీకు అవసరమైన పత్రం రకాన్ని ఎంచుకోండి

source: Rental Agreement
hi: किराया समझौता
te: అద్దె ఒప్పందం

source: Create a professional lease agreement.
hi: एक पेशेवर पट्टा समझौता बनाएं।
te: ఒక వృత్తిపరమైన లీజు ఒప్పందాన్ని సృష్టించండి.

source: Employment Contract
hi: रोजगार अनुबंध
te: ఉద్యోగ ఒప్పందం

source: Define terms of employment clearly.
hi: रोजगार की शर्तों को स्पष्ट रूप से परिभाषित करें।
te: ఉద్యోగ నిబంధనలను స్పష్టంగా నిర్వచించండి.

source: NDA
hi: एनडीए

source: Protect your confidential information.
hi: अपनी गोपनीय जानकारी को सुरक्षित रखें।
te: మీ రహస్య సమాచారాన్ని రక్షించుకోండి.

source: Partnership Agreement
hi: साझेदारी समझौता
te: భాగస్వామ్య ఒప్పందం

source: Formalize your business partnership.
hi: अपनी व्यावसायिक साझेदारी को औपचारिक रूप दें।
te: మీ వ్యాపార భాగస్వామ్యాన్ని అధికారికం చేయండి.

source: Service Agreement
hi: सेवा समझौता
te: సేవా ఒప్పందం

source: Outline terms for services rendered.
hi: प्रदान की गई सेवाओं के लिए शर्तों को रेखांकित करें।
te: అందించిన సేవల కోసం నిబంధనలను వివరించండి.

source: Will & Testament
hi: वसीयत और नियम
te: విల్లు & నిబంధన

source: Specify your last wishes legally.
hi: अपनी अंतिम इच्छाओं को कानूनी रूप से निर्दिष्ट करें।
te: మీ చివరి కోరికలను చట్టబద్ధంగా పేర్కొనండి.

source: Previous
hi: पिछला
te: మునుపటి

source: Next
hi: अगला
te: తదుపరి

source: Step 3: Generate & Download Your Document
hi: चरण 3: अपना दस्तावेज़ बनाएं और डाउनलोड करें
te: దశ 3: మీ పత్రాన్ని రూపొందించండి & డౌన్‌లోడ్ చేయండి

source: Your
hi: आपका
te: మీ

source: is ready.
hi: तैयार है।
te: సిద్ధంగా ఉంది.

source: Generate Document
hi: दस्तावेज़ बनाएं
te: పత్రాన్ని రూపొందించండి

source: Download PDF
hi: पीडीएफ डाउनलोड करें
te: PDF డౌన్‌లోడ్ చేయండి

source: Start Over
hi: फिर से शुरू करें
te: మళ్ళీ ప్రారంభించండి

source: Generating your professional legal document...
hi: आपका पेशेवर कानूनी दस्तावेज़ बनाया जा रहा है...
te: మీ వృత్తిపరమైన చట్టపరమైన పత్రాన్ని రూపొందిస్తోంది...

source: Click "Generate Document" to see your customized legal document here...
hi: अपना अनुकूलित कानूनी दस्तावेज़ यहां देखने के लिए "दस्तावेज़ बनाएं" पर क्लिक करें...
te: మీ అనుకూలీకరించిన చట్టపరమైన పత్రాన్ని ఇక్కడ చూడటానికి "పత్రాన్ని రూపొందించండి" క్లిక్ చేయండి...

source: Finish & Preview
hi: समाप्त करें और पूर्वावलोकन करें
te: పూర్తి చేసి & ప్రివ్యూ చూడండి

source: Please fill all required fields marked with *
hi: कृपया * से चिह्नित सभी आवश्यक फ़ील्ड भरें
te: దయచేసి * తో గుర్తించబడిన అన్ని అవసరమైన ఫీల్డ్‌లను నింపండి

source: An error occurred.
hi: एक त्रुटि हुई।
te: ఒక లోపం సంభవించింది.

source: Please generate the document first before downloading.
hi: कृपया डाउनलोड करने से पहले दस्तावेज़ बनाएं।
te: దయచేసి డౌన్‌లోడ్ చేయడానికి ముందు పత్రాన్ని రూపొందించండి.

source: Document Scanner & Analyzer
hi: दस्तावेज़ स्कैनर और विश्लेषक
te: పత్రం స్కానర్ & విశ్లేషణకారి

source: Capture, upload, or paste a document for instant AI-powered analysis.
hi: तत्काल एआई-संचालित विश्लेषण के लिए एक दस्तावेज़ कैप्चर, अपलोड या पेस्ट करें।
te: తక్షణ AI-ఆధారిత విశ్లేషణ కోసం ఒక పత్రాన్ని క్యాప్చర్ చేయండి, అప్‌లోడ్ చేయండి లేదా అతికించండి.

source: Option 1: Upload or Capture Document
hi: विकल्प 1: दस्तावेज़ अपलोड या कैप्चर करें
te: ఎంపిక 1: పత్రాన్ని అప్‌లోడ్ చేయండి లేదా క్యాప్చర్ చేయండి

source: Take Photo
hi: फोटो लें
te: ఫోటో తీయండి

source: Use your camera to scan a document.
hi: एक दस्तावेज़ को स्कैन करने के लिए अपने कैमरे का उपयोग करें।
te: ఒక పత్రాన్ని స్కాన్ చేయడానికి మీ కెమెరాను ఉపయోగించండి.

source: Upload PDF
hi: पीडीएफ अपलोड करें
te: PDF అప్‌లోడ్ చేయండి

source: Choose a PDF file from your device.
hi: अपने डिवाइस से एक पीडीएफ फाइल चुनें।
te: మీ పరికరం నుండి ఒక PDF ఫైల్‌ను ఎంచుకోండి.

source: Document Camera
hi: दस्तावेज़ कैमरा
te: పత్రం కెమెరా

source: Capture
hi: कैप्चर
te: క్యాప్చర్ చేయండి

source: Retake
hi: फिर से लें
te: మళ్ళీ తీయండి

source: Extract Text
hi: पाठ निकालें
te: పాఠ్యాన్ని సంగ్రహించండి

source: Close
hi: बंद करें
te: మూసివేయండి

source: Analyzing Image...
hi: छवि का विश्लेषण हो रहा है...
te: చిత్రాన్ని విశ్లేషిస్తోంది...

source: Initializing...
hi: शुरू हो रहा है...
te: ప్రారంభిస్తోంది...

source: Analyze PDF
hi: पीडीएफ का विश्लेषण करें
te: PDFని విశ్లేషించండి

source: OR
hi: या
te: లేదా

source: Option 2: Paste Document Text
hi: विकल्प 2: दस्तावेज़ पाठ पेस्ट करें
te: ఎంపిక 2: పత్రం పాఠ్యాన్ని అతికించండి

source: Paste your legal document text here...
hi: अपना कानूनी दस्तावेज़ पाठ यहाँ पेस्ट करें...
te: మీ చట్టపరమైన పత్రం పాఠ్యాన్ని ఇక్కడ అతికించండి...

source: English Analysis
hi: अंग्रेजी विश्लेषण
te: ఆంగ్ల విశ్లేషణ

source: Telugu Analysis
hi: तेलुगु विश्लेषण
te: తెలుగు విశ్లేషణ

source: Hindi Analysis
hi: हिंदी विश्लेषण
te: హిందీ విశ్లేషణ

source: Analyze Text
hi: पाठ का विश्लेषण करें
te: పాఠ్యాన్ని విశ్లేషించండి

source: Clear All
hi: सब साफ़ करें
te: అన్నీ క్లియర్ చేయండి

source: Analyzing document...
hi: दस्तावेज़ का विश्लेषण हो रहा है...
te: పత్రాన్ని విశ్లేషిస్తోంది...

source: AI Analysis:
hi: एआई विश्लेषण:
te: AI విశ్లేషణ:

source: Listen to Analysis
hi: विश्लेषण सुनें
te: విశ్లేషణను వినండి

source: Speak
hi: बोलें
te: మాట్లాడండి

source: Pause
hi: रोकें
te: పాజ్ చేయండి

source: Resume
hi: फिर से शुरू करें
te: కొనసాగించండి

source: Stop
hi: रुकें
te: ఆపండి

source: Clear Result
hi: परिणाम साफ़ करें
te: ఫలితాన్ని క్లియర్ చేయండి

source: Ready to analyze:
hi: विश्लेषण के लिए तैयार:
te: విశ్లేషించడానికి సిద్ధంగా ఉంది:

source: Recognizing...
hi: पहचान हो रही है...
te: గుర్తిస్తోంది...

source: Could not access camera. Please check permissions.
hi: कैमरे तक नहीं पहुंच सका। कृपया अनुमतियों की जांच करें।
te: కెమెరాను యాక్సెస్ చేయలేకపోయింది. దయచేసి అనుమతులను తనిఖీ చేయండి.

source: Error analyzing PDF.
hi: पीडीएफ का विश्लेषण करने में त्रुटि।
te: PDFని విశ్లేషించడంలో లోపం.

source: Error analyzing text.
hi: पाठ का विश्लेषण करने में त्रुटि।
te: పాఠ్యాన్ని విశ్లేషించడంలో లోపం.

source: Overall Tone:
hi: समग्र स्वर:
te: మొత్తం స్వరం:

source: Please select a PDF file first.
hi: कृपया पहले एक पीडीएफ फाइल चुनें।
te: దయచేసి ముందుగా ఒక PDF ఫైల్‌ను ఎంచుకోండి.

source: Please paste text to analyze.
hi: कृपया विश्लेषण के लिए पाठ पेस्ट करें।
te: దయచేసి విశ్లేషించడానికి పాఠ్యాన్ని అతికించండి.

source: VakilSeva - AI Legal Assistant
hi: वकीलसेवा - एआई कानूनी सहायक
te: వకీల్‌సేవ - AI లీగల్ అసిస్టెంట్

source: Justice Made Accessible
hi: न्याय सुलभ बनाया गया
te: న్యాయం అందుబాటులోకి వచ్చింది

source: AI-powered legal assistance for every Indian citizen
hi: हर भारतीय नागरिक के लिए एआई-संचालित कानूनी सहायता
te: ప్రతి భారతీయ పౌరుడికి AI-ఆధారిత చట్టపరమైన సహాయం

source: Get Started
hi: शुरू करें
te: ప్రారంభించండి

source: Smart Legal Documents
hi: स्मार्ट कानूनी दस्तावेज़
te: స్మార్ట్ లీగల్ డాక్యుమెంట్లు

source: Generate professional legal documents in minutes
hi: मिनटों में पेशेवर कानूनी दस्तावेज़ बनाएं
te: నిమిషాల్లో వృత్తిపరమైన చట్టపరమైన పత్రాలను రూపొందించండి

source: Try Now
hi: अभी कोशिश करें
te: ఇప్పుడే ప్రయత్నించండి

source: 24/7 Legal Support
hi: 24/7 कानूनी सहायता
te: 24/7 చట్టపరమైన మద్దతు

source: Always available AI legal assistant at your service
hi: आपकी सेवा में हमेशा उपलब्ध एआई कानूनी सहायक
te: మీ సేవలో ఎల్లప్పుడూ అందుబాటులో ఉండే AI చట్టపరమైన సహాయకుడు

source: Contact Us
hi: हमसे संपर्क करें
te: మమ్మల్ని సంప్రదించండి

source: Welcome to VakilSeva
hi: वकीलसेवा में आपका स्वागत है
te: వకీల్‌సేవకు స్వాగతం

source: Your AI-Powered
hi: आपका एआई-संचालित
te: మీ AI-ఆధారిత

source: Legal Assistant
hi: कानूनी सहायक
te: చట్టపరమైన సహాయకుడు

source: Explore Features
hi: विशेषताएँ देखें
te: ఫీచర్లను అన్వేషించండి

source: Core Features
hi: मुख्य विशेषताएँ
te: ప్రధాన ఫీచర్లు

source: Six AI-powered tools for comprehensive legal assistance
hi: व्यापक कानूनी सहायता के लिए छह एआई-संचालित उपकरण
te: సమగ్ర చట్టపరమైన సహాయం కోసం ఆరు AI-ఆధారిత సాధనాలు

source: Get instant answers to legal questions in simple language, available 24/7.
hi: सरल भाषा में कानूनी सवालों के तत्काल उत्तर प्राप्त करें, 24/7 उपलब्ध।
te: చట్టపరమైన ప్రశ్నలకు సాధారణ భాషలో తక్షణ సమాధానాలు పొందండి, 24/7 అందుబాటులో ఉంటుంది.

source: Try Chatbot
hi: चैटबॉट आज़माएं
te: చాట్‌బాట్‌ను ప్రయత్నించండి

source: Generate professional legal documents with our guided wizard.
hi: हमारे निर्देशित विज़ार्ड के साथ पेशेवर कानूनी दस्तावेज़ बनाएं।
te: మా గైడెడ్ విజార్డ్‌తో వృత్తిపరమైన చట్టపరమైన పత్రాలను రూపొందించండి.

source: Start Drafting
hi: मसौदा तैयार करना शुरू करें
te: డ్రాఫ్టింగ్ ప్రారంభించండి

source: Look up legal terms with simple explanations in Hindi and English.
hi: हिंदी और अंग्रेजी में सरल स्पष्टीकरण के साथ कानूनी शब्दों को देखें।
te: హిందీ మరియు ఆంగ్లంలో సాధారణ వివరణలతో చట్టపరమైన పదాలను వెతకండి.

source: Browse Terms
hi: शर्तें ब्राउज़ करें
te: పదాలను బ్రౌజ్ చేయండి

source: Check eligibility for free legal aid services across India.
hi: पूरे भारत में मुफ्त कानूनी सहायता सेवाओं के लिए पात्रता की जांच करें।
te: భారతదేశం అంతటా ఉచిత చట్టపరమైన సహాయ సేవల కోసం అర్హతను తనిఖీ చేయండి.

source: Check Eligibility
hi: पात्रता जांचें
te: అర్హతను తనిఖీ చేయండి

source: Search relevant case laws and legal precedents from Indian courts.
hi: भारतीय अदालतों से प्रासंगिक केस कानूनों और कानूनी मिसालों की खोज करें।
te: భారతీయ న్యాయస్థానాల నుండి సంబంధిత కేసు చట్టాలు మరియు చట్టపరమైన పూర్వాంశాలను శోధించండి.

source: Upload documents for AI-powered analysis and summary.
hi: एआई-संचालित विश्लेषण और सारांश के लिए दस्तावेज़ अपलोड करें।
te: AI-ఆధారిత విశ్లేషణ మరియు సారాంశం కోసం పత్రాలను అప్‌లోడ్ చేయండి.

source: Analyze Document
hi: दस्तावेज़ का विश्लेषण करें
te: పత్రాన్ని విశ్లేషించండి

source: About VakilSeva
hi: वकीलसेवा के बारे में
te: వకీల్‌సేవ గురించి

source: VakilSeva is a project designed to democratize legal assistance in India through AI technology. Our platform provides instant, reliable, and accessible legal support to every citizen.
hi: वकीलसेवा एक परियोजना है जिसे एआई प्रौद्योगिकी के माध्यम से भारत में कानूनी सहायता को लोकतांत्रिक बनाने के लिए डिज़ाइन किया गया है। हमारा मंच प्रत्येक नागरिक को तत्काल, विश्वसनीय और सुलभ कानूनी सहायता प्रदान करता है।
te: వకీల్‌సేవ అనేది AI సాంకేతికత ద్వారా భారతదేశంలో చట్టపరమైన సహాయాన్ని ప్రజాస్వామ్యీకరించడానికి రూపొందించబడిన ఒక ప్రాజెక్ట్. మా ప్లాట్‌ఫారమ్ ప్రతి పౌరుడికి తక్షణ, విశ్వసనీయమైన మరియు అందుబాటులో ఉండే చట్టపరమైన మద్దతును అందిస్తుంది.

source: We aim to showcase how modern technology can bridge the gap between complex legal expertise and public access to justice, making law understandable for everyone.
hi: हम यह प्रदर्शित करना चाहते हैं कि कैसे आधुनिक तकनीक जटिल कानूनी विशेषज्ञता और न्याय तक सार्वजनिक पहुंच के बीच की खाई को पाट सकती है, जिससे कानून सभी के लिए समझने योग्य हो जाता है।
te: సంక్లిష్టమైన చట్టపరమైన నైపుణ్యం మరియు ప్రజలకు న్యాయం అందుబాటులోకి మధ్య ఉన్న అంతరాన్ని ఆధునిక సాంకేతికత ఎలా తగ్గించగలదో ప్రదర్శించడం మా లక్ష్యం, చట్టాన్ని అందరికీ అర్థమయ్యేలా చేయడం.

source: Try VakilSeva
hi: वकीलसेवा आज़माएं
te: వకీల్‌సేవను ప్రయత్నించండి

source: Our Goals
hi: हमारे लक्ष्य
te: మా లక్ష్యాలు

source: Accessible Legal Help
hi: सुलभ कानूनी मदद
te: అందుబాటులో ఉండే చట్టపరమైన సహాయం

source: Make legal guidance available to everyone
hi: कानूनी मार्गदर्शन सभी के लिए उपलब्ध कराएं
te: చట్టపరమైన మార్గదర్శకత్వాన్ని అందరికీ అందుబాటులో ఉంచండి

source: AI Integration
hi: एआई एकीकरण
te: AI ఇంటిగ్రేషన్

source: Demonstrate practical AI applications in the legal field
hi: कानूनी क्षेत्र में व्यावहारिक एआई अनुप्रयोगों का प्रदर्शन करें
te: చట్టపరమైన రంగంలో ఆచరణాత్మక AI అనువర్తనాలను ప్రదర్శించండి

source: User-Friendly Design
hi: उपयोगकर्ता के अनुकूल डिजाइन
te: వినియోగదారు-స్నేహపూర్వక డిజైన్

source: Create a simple interface for complex legal tasks
hi: जटिल कानूनी कार्यों के लिए एक सरल इंटरफ़ेस बनाएं
te: సంక్లిష్టమైన చట్టపరమైన పనుల కోసం ఒక సాధారణ ఇంటర్‌ఫేస్‌ను సృష్టించండి

source: Get in touch for inquiries or feedback.
hi: पूछताछ या प्रतिक्रिया के लिए संपर्क करें।
te: విచారణలు లేదా అభిప్రాయాల కోసం సంప్రదించండి.

source: Get in Touch
hi: संपर्क में रहें
te: సంప్రదింపులో ఉండండి

source: Have a question or feedback? We'd love to hear from you. Reach out to us directly or use the contact form.
hi: कोई प्रश्न या प्रतिक्रिया है? हमें आपसे सुनना अच्छा लगेगा। हमसे सीधे संपर्क करें या संपर्क फ़ॉर्म का उपयोग करें।
te: ఒక ప్రశ్న లేదా అభిప్రాయం ఉందా? మేము మీ నుండి వినడానికి ఇష్టపడతాము. మమ్మల్ని నేరుగా సంప్రదించండి లేదా సంప్రదింపు ఫారమ్‌ను ఉపయోగించండి.

source: Our Office
hi: हमारा कार्यालय
te: మా కార్యాలయం

source: Email Us
hi: हमें ईमेल करें
te: మాకు ఇమెయిల్ చేయండి

source: Call Us
hi: हमें कॉल करें
te: మాకు కాల్ చేయండి

source: Send a Message
hi: एक संदेश भेजें
te: సందేశం పంపండి

source: Your Name
hi: आपका नाम
te: మీ పేరు

source: Your Email
hi: आपका ईमेल
te: మీ ఈమెయిలు

source: Your message or feedback...
hi: आपका संदेश या प्रतिक्रिया...
te: మీ సందేశం లేదా అభిప్రాయం...

source: Send Message
hi: संदेश भेजें
te: సందేశం పంపు

source: AI-powered legal assistance platform for accessible justice.
hi: सुलभ न्याय के लिए एआई-संचालित कानूनी सहायता मंच।
te: అందుబాటులో ఉండే న్యాయం కోసం AI-ఆధారిత చట్టపరమైన సహాయ వేదిక.

source: Quick Links
hi: त्वरित लिंक्स
te: త్వరిత లింకులు

source: About Us
hi: हमारे बारे में
te: మా గురించి

source: Legal
hi: कानूनी
te: చట్టపరమైన

source: Terms of Service
hi: सेवा की शर्तें
te: సేవా నిబంధనలు

source: Privacy Policy
hi: गोपनीयता नीति
te: గోప్యతా విధానం

source: Disclaimer
hi: अस्वीकरण
te: నిరాకరణ

source: Follow Us
hi: हमें फॉलो करें
te: మమ్మల్ని అనుసరించండి

source: AI Legal Aid Assistant
hi: एआई कानूनी सहायता सहायक
te: AI లీగల్ ఎయిడ్ అసిస్టెంట్

source: AI-Powered Legal Aid Assistant
hi: एआई-संचालित कानूनी सहायता सहायक
te: AI-ఆధారిత లీగల్ ఎయిడ్ అసిస్టెంట్

source: Get a personalized assessment of your eligibility for free legal services in India.
hi: भारत में मुफ्त कानूनी सेवाओं के लिए अपनी पात्रता का व्यक्तिगत मूल्यांकन प्राप्त करें।
te: భారతదేశంలో ఉచిత చట్టపరమైన సేవల కోసం మీ అర్హతపై వ్యక్తిగతీకరించిన అంచనాను పొందండి.

source: Select your State / Union Territory:
hi: अपना राज्य / केंद्र शासित प्रदेश चुनें:
te: మీ రాష్ట్రం / కేంద్ర పాలిత ప్రాంతాన్ని ఎంచుకోండి:

source: Briefly describe your situation:
hi: संक्षेप में अपनी स्थिति का वर्णन करें:
te: మీ పరిస్థితిని క్లుప్తంగా వివరించండి:

source: Example: I am a woman from a scheduled tribe in Odisha. My monthly income is 8,000 rupees and I need help with a property dispute.
hi: उदाहरण: मैं ओडिशा की एक अनुसूचित जनजाति की महिला हूं। मेरी मासिक आय 8,000 रुपये है और मुझे संपत्ति विवाद में मदद चाहिए।
te: ఉదాహరణ: నేను ఒడిశాకు చెందిన షెడ్యూల్డ్ తెగకు చెందిన మహిళను. నా నెలవారీ ఆదాయం 8,000 రూపాయలు మరియు నాకు ఆస్తి వివాదంలో సహాయం కావాలి.

source: Get AI Assessment
hi: एआई मूल्यांकन प्राप्त करें
te: AI అంచనాను పొందండి

source: The AI is analyzing your situation...
hi: एआई आपकी स्थिति का विश्लेषण कर रहा है...
te: AI మీ పరిస్థితిని విశ్లేషిస్తోంది...

source: Speak Result
hi: परिणाम बोलें
te: ఫలితాన్ని చెప్పండి

source: Clear
hi: साफ़ करें
te: క్లియర్ చేయండి

source: Please describe your situation.
hi: कृपया अपनी स्थिति का वर्णन करें।
te: దయచేసి మీ పరిస్థితిని వివరించండి.

source: An error occurred:
hi: एक त्रुटि हुई:
te: ఒక లోపం సంభవించింది:

source: A critical error occurred.
hi: एक गंभीर त्रुटि हुई।
te: ఒక క్లిష్టమైన లోపం సంభవించింది.

source: Enter a legal term to get a clear, AI-powered explanation.
hi: एक स्पष्ट, एआई-संचालित स्पष्टीकरण प्राप्त करने के लिए एक कानूनी शब्द दर्ज करें।
te: ఒక స్పష్టమైన, AI-ఆధారిత వివరణ పొందడానికి ఒక చట్టపరమైన పదాన్ని నమోదు చేయండి.

source: e.g., Tort, Contract, Statute...
hi: जैसे, अपकृत्य, अनुबंध, कानून...
te: ఉదా., టార్ట్, కాంట్రాక్ట్, శాసనం...

source: Search
hi: खोज
te: శోధించండి

source: Searching for definition...
hi: परिभाषा खोजी जा रही है...
te: నిర్వచనం కోసం శోధిస్తోంది...

source: Speak Out
hi: बोलकर सुनाओ
te: బిగ్గరగా చెప్పండి

source: Term not found or server error.
hi: शब्द नहीं मिला या सर्वर त्रुटि।
te: పదం కనుగొనబడలేదు లేదా సర్వర్ లోపం.
